hkust-smartcar/RTLib/src/system/pinout/MIMXRT1052.cpp
bool GetUartRXPinConfig(Config& config, LPUART_Type* uart_base) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (uart_base == LPUART1) {
		if (pin == Name::kGPIO_AD_B0_13) {
			config.mux_mode = Config::MuxMode::kAlt2;
		} else {
			return false;
		}
	} else if (uart_base == LPUART2) {
		if (pin == Name::kGPIO_AD_B1_03 || pin == Name::kGPIO_SD_B1_10) {
			config.mux_mode = Config::MuxMode::kAlt2;
		} else {
			return false;
		}
	} else if (uart_base == LPUART3) {
		if (pin == Name::kGPIO_EMC_14 || pin == Name::kGPIO_AD_B1_07) {
			config.mux_mode = Config::MuxMode::kAlt2;
		} else if (pin == Name::kGPIO_B0_09) {
			config.mux_mode = Config::MuxMode::kAlt3;
		} else {
			return false;
		}
	} else if (uart_base == LPUART4) {
		if (pin == Name::kGPIO_EMC_20 || pin == Name::kGPIO_B1_01) {
			config.mux_mode = Config::MuxMode::kAlt2;
		} else if (pin == Name::kGPIO_SD_B1_01) {
			config.mux_mode = Config::MuxMode::kAlt4;
		} else {
			return false;
		}
	} else if (uart_base == LPUART5) {
		if (pin == Name::kGPIO_EMC_24) {
			config.mux_mode = Config::MuxMode::kAlt2;
		} else if (pin == Name::kGPIO_B1_13) {
			config.mux_mode = Config::MuxMode::kAlt1;
		} else {
			return false;
		}
	} else if (uart_base == LPUART6) {
		if (pin == Name::kGPIO_EMC_26 || pin == Name::kGPIO_AD_B0_03) {
			config.mux_mode = Config::MuxMode::kAlt2;
		} else {
			return false;
		}
	} else if (uart_base == LPUART7) {
		if (pin == Name::kGPIO_EMC_32 || pin == Name::kGPIO_SD_B1_09) {
			config.mux_mode = Config::MuxMode::kAlt2;
		} else {
			return false;
		}
	} else if (uart_base == LPUART8) {
		if (pin == Name::kGPIO_EMC_39 || pin == Name::kGPIO_AD_B1_11 || pin == Name::kGPIO_SD_B0_05) {
			config.mux_mode = Config::MuxMode::kAlt2;
		} else {
			return false;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetI2CSclPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B0_00) {
		config.mux_mode = Config::MuxMode::kAlt4;
		module = 0;
	} else if (pin == Name::kGPIO_AD_B1_00) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((volatile uint32_t*) 0x401F84CC) = 0x1u;
		module = 0;
	} else if (pin == Name::kGPIO_SD_B1_04) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 0;
	} else if (pin == Name::kGPIO_B0_04) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 1;
	} else if (pin == Name::kGPIO_SD_B1_11) {
		config.mux_mode = Config::MuxMode::kAlt3;
		module = 1;
	} else if (pin == Name::kGPIO_EMC_22) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 2;
	} else if (pin == Name::kGPIO_AD_B1_07) {
		config.mux_mode = Config::MuxMode::kAlt1;
		module = 2;
	} else if (pin == Name::kGPIO_SD_B0_00) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 2;
	} else if (pin == Name::kGPIO_AD_B0_12) {
		config.mux_mode = Config::MuxMode::kAlt0;
		module = 3;
	} else if (pin == Name::kGPIO_EMC_12) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 3;
	} else {
		return false;
	}
	config.pin_config.hysteresis_enable = false;
	config.pin_config.fast_slew_rate=false;
	config.pin_config.drive_strength=Config::PinConfig::DriveStrength::kDSE6;
	config.pin_config.speed = Config::PinConfig::Speed::k100MHz2;
	config.pin_config.pull_keep_config=Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.open_drain_enable=true;
	config.force_input = true;
	return true;
}

bool GetI2CSdaPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B0_01) {
		config.mux_mode = Config::MuxMode::kAlt4;
		module = 0;
	} else if (pin == Name::kGPIO_AD_B1_01) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((volatile uint32_t*) 0x401F84D0) = 0x1u;
		module = 0;
	} else if (pin == Name::kGPIO_SD_B1_05) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 0;
	} else if (pin == Name::kGPIO_B0_05) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 1;
	} else if (pin == Name::kGPIO_SD_B1_10) {
		config.mux_mode = Config::MuxMode::kAlt3;
		module = 1;
	} else if (pin == Name::kGPIO_EMC_21) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 2;
	} else if (pin == Name::kGPIO_AD_B1_06) {
		config.mux_mode = Config::MuxMode::kAlt1;
		module = 2;
	} else if (pin == Name::kGPIO_SD_B0_01) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 2;
	} else if (pin == Name::kGPIO_AD_B0_13) {
		config.mux_mode = Config::MuxMode::kAlt0;
		module = 3;
	} else if (pin == Name::kGPIO_EMC_11) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 3;
	} else {
		return false;
	}
	config.pin_config.hysteresis_enable = false;
	config.pin_config.fast_slew_rate=false;
	config.pin_config.drive_strength=Config::PinConfig::DriveStrength::kDSE6;
	config.pin_config.speed = Config::PinConfig::Speed::k100MHz2;
	config.pin_config.pull_keep_config=Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.open_drain_enable=true;
	config.force_input = true;
	return true;
}

bool GetSpiSckPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_27) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((uint32_t*) 0x401F84F0U) = 0;
		module = 1;
	} else if (pin == Name::kGPIO_SD_B0_00) {
		config.mux_mode = Config::MuxMode::kAlt4;
		*((uint32_t*) 0x401F84F0U) = 1;
		module = 1;
	} else if (pin == Name::kGPIO_SD_B1_07) {
		config.mux_mode = Config::MuxMode::kAlt4;
		*((uint32_t*) 0x401F8500U) = 0;
		module = 2;
	} else if (pin == Name::kGPIO_EMC_00) {
		config.mux_mode = Config::MuxMode::kAlt2;
		*((uint32_t*) 0x401F8500U) = 1;
		module = 2;
	} else if (pin == Name::kGPIO_AD_B0_00) {
		config.mux_mode = Config::MuxMode::kAlt7;
		*((uint32_t*) 0x401F8510U) = 0;
		module = 3;
	} else if (pin == Name::kGPIO_AD_B1_15) {
		config.mux_mode = Config::MuxMode::kAlt2;
		*((uint32_t*) 0x401F8510U) = 1;
		module = 3;
	} else if (pin == Name::kGPIO_B0_03) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((uint32_t*) 0x401F8520U) = 0;
		module = 4;
	} else if (pin == Name::kGPIO_B1_07) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F8520U) = 1;
		module = 4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

