hkust-smartcar/RTLib/src/system/pinout/MIMXRT1052.cpp
bool GetSpiSdoPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_28) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((uint32_t*) 0x401F84F8U) = 0;
		module = 1;
	} else if (pin == Name::kGPIO_SD_B0_02) {
		config.mux_mode = Config::MuxMode::kAlt4;
		*((uint32_t*) 0x401F84F8U) = 1;
		module = 1;
	} else if (pin == Name::kGPIO_SD_B1_08) {
		config.mux_mode = Config::MuxMode::kAlt4;
		*((uint32_t*) 0x401F8508U) = 0;
		module = 2;
	} else if (pin == Name::kGPIO_EMC_02) {
		config.mux_mode = Config::MuxMode::kAlt2;
		*((uint32_t*) 0x401F8508U) = 1;
		module = 2;
	} else if (pin == Name::kGPIO_AD_B0_01) {
		config.mux_mode = Config::MuxMode::kAlt7;
		*((uint32_t*) 0x401F8518U) = 0;
		module = 3;
	} else if (pin == Name::kGPIO_AD_B1_14) {
		config.mux_mode = Config::MuxMode::kAlt2;
		*((uint32_t*) 0x401F8518U) = 1;
		module = 3;
	} else if (pin == Name::kGPIO_B0_02) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((uint32_t*) 0x401F8528U) = 0;
		module = 4;
	} else if (pin == Name::kGPIO_B1_06) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F8528U) = 1;
		module = 4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetSpiSdiPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_29) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((uint32_t*) 0x401F84F4U) = 0;
		module = 1;
	} else if (pin == Name::kGPIO_SD_B0_03) {
		config.mux_mode = Config::MuxMode::kAlt4;
		*((uint32_t*) 0x401F84F4U) = 1;
		module = 1;
	} else if (pin == Name::kGPIO_SD_B1_09) {
		config.mux_mode = Config::MuxMode::kAlt4;
		*((uint32_t*) 0x401F8504U) = 0;
		module = 2;
	} else if (pin == Name::kGPIO_EMC_03) {
		config.mux_mode = Config::MuxMode::kAlt2;
		*((uint32_t*) 0x401F8504U) = 1;
		module = 2;
	} else if (pin == Name::kGPIO_AD_B0_02) {
		config.mux_mode = Config::MuxMode::kAlt7;
		*((uint32_t*) 0x401F8514U) = 0;
		module = 3;
	} else if (pin == Name::kGPIO_AD_B1_13) {
		config.mux_mode = Config::MuxMode::kAlt2;
		*((uint32_t*) 0x401F8514U) = 1;
		module = 3;
	} else if (pin == Name::kGPIO_B0_01) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((uint32_t*) 0x401F8524U) = 0;
		module = 4;
	} else if (pin == Name::kGPIO_B1_05) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F8524U) = 1;
		module = 4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetSpiPCSPinConfig(Config& config, uint8_t& module, uint8_t& cs) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_30) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((uint32_t*) 0x401F84ECU) = 1;
		module = 1;
		cs = 0;
	} else if (pin == Name::kGPIO_SD_B0_01) {
		config.mux_mode = Config::MuxMode::kAlt4;
		*((uint32_t*) 0x401F84ECU) = 0;
		module = 1;
		cs = 0;
	} else if (pin == Name::kGPIO_SD_B1_06) {
		config.mux_mode = Config::MuxMode::kAlt4;
		*((uint32_t*) 0x401F84FCU) = 0;
		module = 2;
		cs = 0;
	} else if (pin == Name::kGPIO_EMC_01) {
		config.mux_mode = Config::MuxMode::kAlt2;
		*((uint32_t*) 0x401F84FCU) = 1;
		module = 2;
		cs = 0;
	} else if (pin == Name::kGPIO_AD_B0_03) {
		config.mux_mode = Config::MuxMode::kAlt7;
		*((uint32_t*) 0x401F850CU) = 0;
		module = 3;
		cs = 0;
	} else if (pin == Name::kGPIO_AD_B1_12) {
		config.mux_mode = Config::MuxMode::kAlt2;
		*((uint32_t*) 0x401F850CU) = 1;
		module = 3;
		cs = 0;
	} else if (pin == Name::kGPIO_B0_00) {
		config.mux_mode = Config::MuxMode::kAlt3;
		*((uint32_t*) 0x401F851CU) = 0;
		module = 4;
		cs = 0;
	} else if (pin == Name::kGPIO_B1_04) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F851CU) = 1;
		module = 4;
		cs = 0;
	} else if (pin == Name::kGPIO_EMC_31) {
		config.mux_mode = Config::MuxMode::kAlt3;
		module = 1;
		cs = 1;
	} else if (pin == Name::kGPIO_EMC_14) {
		config.mux_mode = Config::MuxMode::kAlt4;
		module = 2;
		cs = 1;
	} else if (pin == Name::kGPIO_AD_B0_04) {
		config.mux_mode = Config::MuxMode::kAlt7;
		module = 3;
		cs = 1;
	} else if (pin == Name::kGPIO_B1_03) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 4;
		cs = 1;
	} else if (pin == Name::kGPIO_EMC_40) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 1;
		cs = 2;
	} else if (pin == Name::kGPIO_SD_B1_10) {
		config.mux_mode = Config::MuxMode::kAlt4;
		module = 2;
		cs = 2;
	} else if (pin == Name::kGPIO_AD_B0_05) {
		config.mux_mode = Config::MuxMode::kAlt7;
		module = 3;
		cs = 2;
	} else if (pin == Name::kGPIO_B1_02) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 4;
		cs = 2;
	} else if (pin == Name::kGPIO_EMC_41) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 1;
		cs = 3;
	} else if (pin == Name::kGPIO_SD_B1_11) {
		config.mux_mode = Config::MuxMode::kAlt4;
		module = 2;
		cs = 3;
	} else if (pin == Name::kGPIO_AD_B0_06) {
		config.mux_mode = Config::MuxMode::kAlt7;
		module = 3;
		cs = 3;
	} else if (pin == Name::kGPIO_B1_11) {
		config.mux_mode = Config::MuxMode::kAlt6;
		module = 4;
		cs = 3;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetFlexSpiSckPinConfig(Config& config) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_SD_B1_07) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84C8U) = 0;
	} else if (pin == Name::kGPIO_AD_B1_14) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84C8U) = 1;
	} else if (pin == Name::kGPIO_SD_B1_04) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F8504U) = 0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = true;
	return true;
}

bool GetFlexSpiSioPinConfig(Config& config) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B1_10) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84B4U) = 1;
	} else if (pin == Name::kGPIO_AD_B1_11) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84B0U) = 1;
	} else if (pin == Name::kGPIO_AD_B1_12) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84ACU) = 1;
	} else if (pin == Name::kGPIO_AD_B1_13) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84A8U) = 1;
	} else if (pin == Name::kGPIO_SD_B1_08) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84A8U) = 0;
	} else if (pin == Name::kGPIO_SD_B1_09) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84ACU) = 0;
	} else if (pin == Name::kGPIO_SD_B1_10) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84B0U) = 0;
	} else if (pin == Name::kGPIO_SD_B1_11) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84B4U) = 0;
	} else if (pin == Name::kGPIO_AD_B1_04) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84C4U) = 1;
	} else if (pin == Name::kGPIO_AD_B1_05) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84C0U) = 1;
	} else if (pin == Name::kGPIO_AD_B1_06) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84BCU) = 1;
	} else if (pin == Name::kGPIO_AD_B1_07) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84B8U) = 1;
	} else if (pin == Name::kGPIO_SD_B1_00) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84C4U) = 0;
	} else if (pin == Name::kGPIO_SD_B1_01) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84C0U) = 0;
	} else if (pin == Name::kGPIO_SD_B1_02) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84BCU) = 0;
	} else if (pin == Name::kGPIO_SD_B1_03) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84B8U) = 0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = true;
	return true;
}

bool GetFlexSpiCSPinConfig(Config& config, uint8_t& cs) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B1_08) {
		config.mux_mode = Config::MuxMode::kAlt0;
		cs = 1;
	} else if (pin == Name::kGPIO_AD_B1_15) {
		config.mux_mode = Config::MuxMode::kAlt0;
		cs = 0;
	} else if (pin == Name::kGPIO_SD_B0_00) {
		config.mux_mode = Config::MuxMode::kAlt6;
		cs = 1;
	} else if (pin == Name::kGPIO_SD_B1_04) {
		config.mux_mode = Config::MuxMode::kAlt4;
		cs = 1;
	} else if (pin == Name::kGPIO_SD_B1_06) {
		config.mux_mode = Config::MuxMode::kAlt1;
		cs = 0;
	} else if (pin == Name::kGPIO_SD_B0_01) {
		config.mux_mode = Config::MuxMode::kAlt6;
		cs = 3;
	} else if (pin == Name::kGPIO_SD_B0_04) {
		config.mux_mode = Config::MuxMode::kAlt4;
		cs = 2;
	} else if (pin == Name::kGPIO_SD_B1_05) {
		config.mux_mode = Config::MuxMode::kAlt4;
		cs = 2;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = true;
	return true;
}

bool GetFlexSpiDQSPinConfig(Config& config) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_SD_B0_05) {
		config.mux_mode = Config::MuxMode::kAlt4;
	} else if (pin == Name::kGPIO_AD_B1_09) {
		config.mux_mode = Config::MuxMode::kAlt0;
		*((uint32_t*) 0x401F84A4U) = 1;
	} else if (pin == Name::kGPIO_SD_B1_05) {
		config.mux_mode = Config::MuxMode::kAlt1;
		*((uint32_t*) 0x401F84A4U) = 0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = true;
	return true;
}

