hkust-smartcar/RTLib/src/system/pinout/MIMXRT1052.cpp
bool GetCSIData0PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_10) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 0;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData1PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_11) {
		config.mux_mode = Config::MuxMode::kAlt2;
		module = 0;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData2PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B0_11 || pin == Name::kGPIO_AD_B1_15) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B0_11) {
			*((uint32_t*) 0x401F8400U) = 0x1u;
		} else {
			*((uint32_t*) 0x401F8400U) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData3PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B0_10 || pin == Name::kGPIO_AD_B1_14) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B0_10) {
			*((uint32_t*) 0x401F8404U) = 0x1u;
		} else {
			*((uint32_t*) 0x401F8404U) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData4PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B0_09 || pin == Name::kGPIO_AD_B1_13) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B0_09) {
			*((uint32_t*) 0x401F8408U) = 0x1u;
		} else {
			*((uint32_t*) 0x401F8408U) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData5PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B0_08 || pin == Name::kGPIO_AD_B1_12) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B0_08) {
			*((uint32_t*) 0x401F840CU) = 0x1u;
		} else {
			*((uint32_t*) 0x401F840CU) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData6PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B0_07 || pin == Name::kGPIO_AD_B1_11) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B0_07) {
			*((uint32_t*) 0x401F8410U) = 0x1u;
		} else {
			*((uint32_t*) 0x401F8410U) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData7PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B0_06 || pin == Name::kGPIO_AD_B1_10) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B0_06) {
			*((uint32_t*) 0x401F8414U) = 0x1u;
		} else {
			*((uint32_t*) 0x401F8414U) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData8PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B1_09 || pin == Name::kGPIO_AD_B0_05) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B0_05) {
			*((uint32_t*) 0x401F8418U) = 0x1u;
		} else {
			*((uint32_t*) 0x401F8418U) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData9PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B1_08 || pin == Name::kGPIO_AD_B0_04) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B0_04) {
			*((uint32_t*) 0x401F841CU) = 0x1u;
		} else {
			*((uint32_t*) 0x401F841CU) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData10PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_09) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt2;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData11PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_08) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt2;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData12PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_07) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt2;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData13PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_06) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt2;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData14PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_05) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt2;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData15PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_04) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt2;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData16PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_37) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData17PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_36) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData18PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_35) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData19PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_34) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

