hkust-smartcar/RTLib/src/system/pinout/MIMXRT1052.cpp
bool GetCSIData20PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_33) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData21PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_32) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData22PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_31) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIData23PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_30) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIFieldPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_EMC_38) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIHsyncPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B1_07 || pin == Name::kGPIO_B1_14 || pin == Name::kGPIO_AD_B0_15) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B1_07) {
			*((uint32_t*) 0x401F8420U) = 0x1u;
		} else if (pin == Name::kGPIO_B1_14) {
			*((uint32_t*) 0x401F8420U) = 0x2u;
			config.mux_mode = Config::MuxMode::kAlt2;
		} else {
			*((uint32_t*) 0x401F8420U) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIMclkPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B1_05 || pin == Name::kGPIO_B1_15) {
		module = 0;
		config.mux_mode = pin == Name::kGPIO_AD_B1_05 ? Config::MuxMode::kAlt4 : Config::MuxMode::kAlt2;
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIPclkPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_12 || pin == Name::kGPIO_AD_B1_04) {
		module = 0;
		if (pin == Name::kGPIO_B1_12) {
			*((uint32_t*) 0x401F8424U) = 0x1u;
			config.mux_mode = Config::MuxMode::kAlt2;
		} else {
			*((uint32_t*) 0x401F8424U) = 0x0u;
			config.mux_mode = Config::MuxMode::kAlt4;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GetCSIVsyncPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_AD_B0_14 || pin == Name::kGPIO_AD_B1_06 || pin == Name::kGPIO_B1_13) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt4;
		if (pin == Name::kGPIO_AD_B1_06) {
			*((uint32_t*) 0x401F8428U) = 0x1u;
		} else if (pin == Name::kGPIO_B1_13) {
			*((uint32_t*) 0x401F8428U) = 0x2u;
			config.mux_mode = Config::MuxMode::kAlt2;
		} else {
			*((uint32_t*) 0x401F8428U) = 0x0u;
		}
	} else {
		return false;
	}
	config.force_input = false;
	return true;
}

bool GeteLCDIFData0PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_04) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData1PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_05) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData2PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_06) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData3PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_07) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData4PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_08) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData5PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_09) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

