hkust-smartcar/RTLib/src/system/pinout/MIMXRT1052.cpp
bool GeteLCDIFData6PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_10) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData7PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_11) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData8PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_12) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData9PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_13) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData10PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_14) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData11PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_15) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData12PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_00) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData13PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_01) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData14PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_02) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData15PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_03) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData16PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_04) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData17PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_05) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData18PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_06) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData19PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_07) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData20PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_08) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData21PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_09) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

