hkust-smartcar/RTLib/src/system/pinout/MIMXRT1052.cpp
bool GeteLCDIFData22PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_10) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFData23PinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B1_11) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFEnablePinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_01) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFHsyncPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_02) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFVsyncPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_03) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}

bool GeteLCDIFPclkPinConfig(Config& config, uint8_t& module) {
	if (pin_active[(uint8_t) config.pin]) {
		return false;
	}
	Name pin = config.pin;
	if (pin == Name::kGPIO_B0_00) {
		module = 0;
		config.mux_mode = Config::MuxMode::kAlt0;
	} else {
		return false;
	}
	config.pin_config.fast_slew_rate = true;
	config.pin_config.speed = Config::PinConfig::Speed::k200MHz;
	config.pin_config.open_drain_enable = false;
	config.pin_config.pull_keep_config = Config::PinConfig::PullKeepConfig::kKeep;
	config.pin_config.hysteresis_enable = false;
	config.force_input = false;
	return true;
}


void InitPin(Config& config) {
	if (pin_active[(uint8_t) config.pin]) {
		assert(false);
	} else {
		pin_active[(uint8_t) config.pin] = true;
	}
	System::CLOCK_EnableClock(System::kCLOCK_Iomuxc); /* iomuxc clock (iomuxc_clk_enable): 0x03u */
	*((volatile uint32_t*) (0x401F8014U + ((uint32_t) config.pin) * 4u)) = IOMUXC_SW_MUX_CTL_PAD_MUX_MODE((uint8_t) config.mux_mode) | IOMUXC_SW_MUX_CTL_PAD_SION(config.force_input);
	uint32_t pin_config_reg = 0;
	pin_config_reg |= (uint32_t) config.pin_config.fast_slew_rate;
	pin_config_reg |= (uint32_t)(((uint32_t) config.pin_config.drive_strength) << 3);
	pin_config_reg |= (uint32_t)(((uint32_t) config.pin_config.speed) << 6);
	pin_config_reg |= (uint32_t)(((uint32_t) config.pin_config.open_drain_enable) << 11);
	if (config.pin_config.pull_keep_config != Config::PinConfig::PullKeepConfig::kDisable) {
		pin_config_reg |= 1 << 12;
		if (config.pin_config.pull_keep_config == Config::PinConfig::PullKeepConfig::kPull) {
			pin_config_reg |= 1 << 13;
		}
		pin_config_reg |= (uint32_t)(((uint32_t) config.pin_config.pull_config) << 14);
	}
	pin_config_reg |= (uint32_t)(((uint32_t) config.pin_config.hysteresis_enable) << 16);
	*((volatile uint32_t*) (0x401F8204U + ((uint32_t) config.pin) * 4u)) = pin_config_reg;
}

void DeinitPin(System::Pinout::Name pin_name) {
	pin_active[(uint8_t) pin_name] = false;
}

}
}
